---
title: "Need help when trying to &quot;make&quot; ndiswrapper - 1.38"
date: 2007-03-12
forum: Absolute Beginner Talk
---

### Post by j2p2f2 on 2007-03-12
Ive been trying to install the new ndiswrapper because i need it to run my wg111 v2. I have the drivers and everything, but if i use the ndiswrapper -i [driver location] it says ndiswrapper is not installed. I went out and got the new version because im using edgy and it wont make the installer. When i run make in the directory, I get a ton of errors that I have no clue how to fix. Im assuming im missing a package build the files with?

I have downloaded and tried to install:
Build-essentials
Libgcc
gcc
make-3.81
libc6
ndiswrapper-common

all give newer version error.

I did have one thing i understood, which was ai needed libc-dev | libc6-dev so i went to google and downloaded the headers, but i dont know if i got the right file.

Here is the error it gave me from the "make" command.

```

farkas@Compaq-Jeff-Linux:~/Desktop/ndiswrapper-1.38$ make
make -C driver
make[1]: Entering directory `/home/farkas/Desktop/ndiswrapper-1.38/driver'
make -C /lib/modules/2.6.17-10-generic/build SUBDIRS=/home/farkas/Desktop/ndiswrapper-1.38/driver
make[2]: Entering directory `/usr/src/linux-headers-2.6.17-10-generic'
  Building modules, stage 2.
  MODPOST
make[2]: Leaving directory `/usr/src/linux-headers-2.6.17-10-generic'
make[1]: Leaving directory `/home/farkas/Desktop/ndiswrapper-1.38/driver'
make -C utils
make[1]: Entering directory `/home/farkas/Desktop/ndiswrapper-1.38/utils'
gcc -g -Wall -I../driver -o loadndisdriver loadndisdriver.c
loadndisdriver.c:15:20: error: stdlib.h: No such file or directory
loadndisdriver.c:16:19: error: stdio.h: No such file or directory
loadndisdriver.c:17:19: error: errno.h: No such file or directory
loadndisdriver.c:18:20: error: string.h: No such file or directory
loadndisdriver.c:19:20: error: libgen.h: No such file or directory
loadndisdriver.c:21:22: error: sys/mman.h: No such file or directory
loadndisdriver.c:23:23: error: sys/types.h: No such file or directory
loadndisdriver.c:24:23: error: sys/ioctl.h: No such file or directory
loadndisdriver.c:25:22: error: sys/stat.h: No such file or directory
loadndisdriver.c:26:20: error: unistd.h: No such file or directory
loadndisdriver.c:27:19: error: fcntl.h: No such file or directory
In file included from /usr/lib/gcc/i486-linux-gnu/4.1.2/include/syslimits.h:7,
                 from /usr/lib/gcc/i486-linux-gnu/4.1.2/include/limits.h:11,
                 from loadndisdriver.c:28:
/usr/lib/gcc/i486-linux-gnu/4.1.2/include/limits.h:122:61: error: limits.h: No such file or directory
loadndisdriver.c:29:19: error: ctype.h: No such file or directory
loadndisdriver.c:30:20: error: dirent.h: No such file or directory
loadndisdriver.c:31:20: error: syslog.h: No such file or directory
loadndisdriver.c:34:25: error: linux/major.h: No such file or directory
loadndisdriver.c:35:25: error: linux/ioctl.h: No such file or directory
In file included from loadndisdriver.c:37:
../driver/loader.h:24: error: expected specifier-qualifier-list before Гўв‚¬Лњsize_tГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_fileГўв‚¬в„ў:
loadndisdriver.c:67: error: Гўв‚¬Лњsize_tГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:67: error: (Each undeclared identifier is reported only once
loadndisdriver.c:67: error: for each function it appears in.)
loadndisdriver.c:67: error: expected Гўв‚¬Лњ;Гўв‚¬в„ў before Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:68: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:69: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:71: warning: implicit declaration of function Гўв‚¬ЛњbasenameГўв‚¬в„ў
loadndisdriver.c:71: warning: initialization makes pointer from integer without a cast
loadndisdriver.c:73: warning: implicit declaration of function Гўв‚¬ЛњopenГўв‚¬в„ў
loadndisdriver.c:73: error: Гўв‚¬ЛњO_RDONLYГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:75: warning: implicit declaration of function Гўв‚¬ЛњsyslogГўв‚¬в„ў
loadndisdriver.c:75: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:75: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:75: warning: implicit declaration of function Гўв‚¬ЛњstrerrorГўв‚¬в„ў
loadndisdriver.c:75: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:76: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:79: warning: implicit declaration of function Гўв‚¬ЛњfstatГўв‚¬в„ў
loadndisdriver.c:81: warning: implicit declaration of function Гўв‚¬ЛњcloseГўв‚¬в„ў
loadndisdriver.c:84: error: Гўв‚¬ЛњsizeГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:86: warning: implicit declaration of function Гўв‚¬ЛњmmapГўв‚¬в„ў
loadndisdriver.c:86: error: Гўв‚¬ЛњPROT_READГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:86: error: Гўв‚¬ЛњMAP_PRIVATEГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:86: warning: assignment makes pointer from integer without a cast
loadndisdriver.c:87: error: Гўв‚¬ЛњMAP_FAILEDГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:93: warning: implicit declaration of function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:93: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:95: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:96: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:69: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњparse_setting_lineГўв‚¬в„ў:
loadndisdriver.c:109: warning: implicit declaration of function Гўв‚¬ЛњisspaceГўв‚¬в„ў
loadndisdriver.c:115: warning: implicit declaration of function Гўв‚¬ЛњstrchrГўв‚¬в„ў
loadndisdriver.c:115: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrchrГўв‚¬в„ў
loadndisdriver.c:115: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:117: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:117: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:118: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:138: warning: implicit declaration of function Гўв‚¬ЛњstrlenГўв‚¬в„ў
loadndisdriver.c:138: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrlenГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњread_conf_fileГўв‚¬в„ў:
loadndisdriver.c:150: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:151: error: Гўв‚¬ЛњFILEГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:151: error: Гўв‚¬ЛњconfigГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:157: warning: implicit declaration of function Гўв‚¬ЛњlstatГўв‚¬в„ў
loadndisdriver.c:158: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:158: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:158: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:160: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:163: warning: implicit declaration of function Гўв‚¬ЛњsscanfГўв‚¬в„ў
loadndisdriver.c:163: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњsscanfГўв‚¬в„ў
loadndisdriver.c:179: warning: implicit declaration of function Гўв‚¬ЛњfopenГўв‚¬в„ў
loadndisdriver.c:179: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:183: warning: implicit declaration of function Гўв‚¬ЛњfgetsГўв‚¬в„ў
loadndisdriver.c:195: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:206: warning: implicit declaration of function Гўв‚¬ЛњfcloseГўв‚¬в„ў
loadndisdriver.c:150: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_bin_fileГўв‚¬в„ў:
loadndisdriver.c:218: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:218: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:220: warning: implicit declaration of function Гўв‚¬ЛњtolowerГўв‚¬в„ў
loadndisdriver.c:222: warning: implicit declaration of function Гўв‚¬ЛњchdirГўв‚¬в„ў
loadndisdriver.c:223: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:225: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:231: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:233: warning: implicit declaration of function Гўв‚¬ЛњioctlГўв‚¬в„ў
loadndisdriver.c:233: warning: implicit declaration of function Гўв‚¬Лњ_IOWГўв‚¬в„ў
loadndisdriver.c:233: error: expected expression before Гўв‚¬ЛњstructГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_driverГўв‚¬в„ў:
loadndisdriver.c:250: error: Гўв‚¬ЛњDIRГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:250: error: Гўв‚¬Лњdriver_dirГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:252: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:256: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:256: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:258: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:260: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:262: warning: implicit declaration of function Гўв‚¬ЛњopendirГўв‚¬в„ў
loadndisdriver.c:268: warning: implicit declaration of function Гўв‚¬ЛњmallocГўв‚¬в„ў
loadndisdriver.c:268: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmallocГўв‚¬в„ў
loadndisdriver.c:272: warning: implicit declaration of function Гўв‚¬ЛњmemsetГўв‚¬в„ў
loadndisdriver.c:272: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemsetГўв‚¬в„ў
loadndisdriver.c:273: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:281: warning: implicit declaration of function Гўв‚¬ЛњreaddirГўв‚¬в„ў
loadndisdriver.c:281: warning: assignment makes pointer from integer without a cast
loadndisdriver.c:283: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:285: error: dereferencing pointer to incomplete type
loadndisdriver.c:288: warning: implicit declaration of function Гўв‚¬ЛњstatГўв‚¬в„ў
loadndisdriver.c:288: error: dereferencing pointer to incomplete type
loadndisdriver.c:289: warning: implicit declaration of function Гўв‚¬ЛњS_ISREGГўв‚¬в„ў
loadndisdriver.c:290: error: dereferencing pointer to incomplete type
loadndisdriver.c:295: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrlenГўв‚¬в„ў
loadndisdriver.c:295: error: dereferencing pointer to incomplete type
loadndisdriver.c:297: warning: implicit declaration of function Гўв‚¬ЛњstrcasecmpГўв‚¬в„ў
loadndisdriver.c:297: error: dereferencing pointer to incomplete type
loadndisdriver.c:300: error: dereferencing pointer to incomplete type
loadndisdriver.c:303: error: dereferencing pointer to incomplete type
loadndisdriver.c:304: error: dereferencing pointer to incomplete type
loadndisdriver.c:306: error: dereferencing pointer to incomplete type
loadndisdriver.c:312: error: dereferencing pointer to incomplete type
loadndisdriver.c:313: error: dereferencing pointer to incomplete type
loadndisdriver.c:314: warning: implicit declaration of function Гўв‚¬ЛњstrcpyГўв‚¬в„ў
loadndisdriver.c:314: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrcpyГўв‚¬в„ў
loadndisdriver.c:315: error: dereferencing pointer to incomplete type
loadndisdriver.c:318: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:319: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:322: error: dereferencing pointer to incomplete type
loadndisdriver.c:283: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c:345: error: expected expression before Гўв‚¬ЛњstructГўв‚¬в„ў
loadndisdriver.c:347: warning: implicit declaration of function Гўв‚¬ЛњclosedirГўв‚¬в„ў
loadndisdriver.c:349: warning: implicit declaration of function Гўв‚¬ЛњfreeГўв‚¬в„ў
loadndisdriver.c:356: warning: implicit declaration of function Гўв‚¬ЛњmunmapГўв‚¬в„ў
loadndisdriver.c:356: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:356: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:358: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:358: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњget_deviceГўв‚¬в„ў:
loadndisdriver.c:368: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:371: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:371: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:374: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:375: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:377: warning: implicit declaration of function Гўв‚¬ЛњsnprintfГўв‚¬в„ў
loadndisdriver.c:377: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњsnprintfГўв‚¬в„ў
loadndisdriver.c:408: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:368: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_deviceГўв‚¬в„ў:
loadndisdriver.c:420: error: Гўв‚¬ЛњDIRГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:420: error: Гўв‚¬ЛњdirГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:424: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:424: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:425: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemsetГўв‚¬в„ў
loadndisdriver.c:427: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:428: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:430: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:435: warning: assignment makes pointer from integer without a cast
loadndisdriver.c:436: error: dereferencing pointer to incomplete type
loadndisdriver.c:437: error: dereferencing pointer to incomplete type
loadndisdriver.c:440: error: dereferencing pointer to incomplete type
loadndisdriver.c:449: error: expected expression before Гўв‚¬ЛњstructГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњget_ioctl_deviceГўв‚¬в„ў:
loadndisdriver.c:466: error: Гўв‚¬ЛњFILEГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:466: error: Гўв‚¬Лњproc_miscГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:474: warning: implicit declaration of function Гўв‚¬ЛњstrstrГўв‚¬в„ў
loadndisdriver.c:474: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrstrГўв‚¬в„ў
loadndisdriver.c:475: warning: implicit declaration of function Гўв‚¬ЛњstrtolГўв‚¬в„ў
loadndisdriver.c:475: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:485: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:485: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:490: warning: implicit declaration of function Гўв‚¬ЛњunlinkГўв‚¬в„ў
loadndisdriver.c:491: warning: implicit declaration of function Гўв‚¬ЛњmknodГўв‚¬в„ў
loadndisdriver.c:491: error: Гўв‚¬ЛњS_IFCHRГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:491: error: Гўв‚¬ЛњMISC_MAJORГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:492: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:497: error: Гўв‚¬ЛњO_RDONLYГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c: In function Гўв‚¬ЛњmainГўв‚¬в„ў:
loadndisdriver.c:513: warning: implicit declaration of function Гўв‚¬ЛњopenlogГўв‚¬в„ў
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_PERRORГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_CONSГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_DEBUGГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:515: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:517: warning: implicit declaration of function Гўв‚¬ЛњstrncmpГўв‚¬в„ў
loadndisdriver.c:519: warning: implicit declaration of function Гўв‚¬ЛњprintfГўв‚¬в„ў
loadndisdriver.c:519: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњprintfГўв‚¬в„ў
loadndisdriver.c:529: warning: implicit declaration of function Гўв‚¬ЛњatoiГўв‚¬в„ў
loadndisdriver.c:544: warning: implicit declaration of function Гўв‚¬ЛњatofГўв‚¬в„ў
loadndisdriver.c:551: warning: implicit declaration of function Гўв‚¬ЛњstrcmpГўв‚¬в„ў
loadndisdriver.c:558: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњsscanfГўв‚¬в„ў
loadndisdriver.c:592: warning: implicit declaration of function Гўв‚¬ЛњcloselogГўв‚¬в„ў
make[1]: *** [loadndisdriver] Error 1
make[1]: Leaving directory `/home/farkas/Desktop/ndiswrapper-1.38/utils'
make: *** [all] Error 2
farkas@Compaq-Jeff-Linux:~/Desktop/ndiswrapper-1.38$ 

```

Thanks for any help you can give :)

---

### Post by benfindlay on 2007-03-13
may be a daft question, but did you go into the directory and do ```
./configure
``` first?

---

### Post by pab0pab0 on 2007-03-21
I just had this problem too. You need to add some C libraries and headers. If you go to the package manager and scroll almost to the bottom you should see something along these lines. Click to install it and then make should work alright!

---

